# Add tap for imgcat image display tool
tap "danielgatis/imgcat"
# Add tap for managing system services with Homebrew
tap "homebrew/services"
# Add MongoDB's official Homebrew tap
tap "mongodb/brew"
# Add Tabby AI code completion tool tap
tap "tabbyml/tabby"
# Install AI-powered chat CLI tool
brew "aichat"
# Install Gemini protocol browser for terminal
brew "amfora"
# Install Node.js JavaScript runtime
brew "node"
# Install Angular command-line interface
brew "angular-cli"
# Install command-line argument parser generator
brew "argc"
# Install Python 3.12 interpreter
brew "python@3.12"
# Install smart directory navigation tool
brew "autojump"
# Install syntax-highlighted cat replacement
brew "bat"
# Install shell completion generator
brew "carapace"
# Install code minimap visualization tool
brew "code-minimap"
# Install container runtime for macOS
brew "colima"
# Install GNU core utilities
brew "coreutils"
# Install development container CLI
brew "devcontainer"
# Install enhanced diff output tool
brew "diff-so-fancy"
# Install Docker container platform
brew "docker"
# Install Docker build extension
brew "docker-buildx"
# Install Docker multi-container orchestration
brew "docker-compose"
# Install Docker credential management helper
brew "docker-credential-helper"
# Install Docker container management TUI
brew "dockly"
# Install disk usage analyzer
brew "duf"
# Install directory size analyzer
brew "dust"
# Install file watcher for running commands
brew "entr"
# Install JavaScript linter
brew "eslint"
# Install modern ls replacement
brew "eza"
# Install fast find alternative
brew "fd"
# Install multimedia framework
brew "ffmpeg"
# Install ASCII art text generator
brew "figlet"
# Install log shipper for Elastic Stack
brew "filebeat"
# Install file system event monitor
brew "fswatch"
# Install fuzzy finder
brew "fzf"
# Install GIF manipulation tool
brew "gifsicle"
# Install Git version control system
brew "git"
# Install syntax-highlighted git diff viewer
brew "git-delta"
# Install Git repository filtering tool
brew "git-filter-repo"
# Install GitLab CI/CD runner
brew "gitlab-runner"
# Install Git secrets scanner
brew "gitleaks"
# Install GNU version of sed
brew "gnu-sed"
# Install IPC library for GnuPG
brew "libassuan"
# Install GNU Privacy Guard
brew "gnupg"
# Install Go programming language
brew "go"
# Install Go linter aggregator
brew "golangci-lint"
# Install Go language server
brew "gopls"
# Install human-readable JSON parser
brew "hjson"
# Install interactive process viewer
brew "htop"
# Install image manipulation toolkit
brew "imagemagick"
# Install OpenJDK Java development kit
brew "openjdk"
# Install Java language server
brew "jdtls"
# Install Jira command-line interface
brew "jira-cli"
# Install Jujutsu version control system
brew "jj"
# Install TUI for Jujutsu VCS
brew "jjui"
# Install JSON processor
brew "jq"
# Install Git TUI client
brew "lazygit"
# Install Jujutsu TUI client
brew "lazyjj"
# Install sophisticated FTP client
brew "lftp"
# Install additional guest agents for Lima
brew "lima-additional-guestagents"
# Install log file navigator
brew "lnav"
# Install data processing pipeline
brew "logstash"
# Install Lua language server
brew "lua-language-server"
# Install link checker
brew "lychee"

# Install GNU Make build tool
brew "make"

# LSP server for markdown
brew "marksman"

# Install Markdown linter
brew "markdownlint-cli"
# Install static site generator for documentation
brew "mkdocs"
# Install MongoDB shell
brew "mongosh"
# Install parser generator for syntax highlighting
brew "tree-sitter"
# Install modern Vim-based text editor
brew "neovim"
# Install Qt GUI for Neovim
brew "neovim-qt"
# Install Node.js version 24
brew "node@24"
# Install Node Version Manager
brew "nvm"
# Install universal document converter
brew "pandoc"
# Install password manager
brew "pass"
# Install Python application installer
brew "pipx"
# Install UML diagram generator
brew "plantuml"
# Install clipboard to PNG utility
brew "pngpaste"
# Install shell prompt enhancement
brew "powerline-go"
# Install image viewer
brew "pqiv"
# Install code formatter
brew "prettier"
# Install password generator
brew "pwgen"
# Install Python language server
brew "python-lsp-server"
# Install Python-based Vim clone
brew "pyvim"
# Install profiling data visualization tool
brew "qcachegrind"
# Install file manager with VI key bindings
brew "ranger"
# Install enhanced Make with debugging
brew "remake"
# Install dependency update automation tool
brew "renovate"
# Install fast text search tool
brew "ripgrep"

# Install Rust programming language
# brew "rust"
# 💣 does not work with brew, use rustup, see obsidian://open?vault=obsperso&file=Permanent%2FInformatique%2FRust

# Install SMB/CIFS file sharing
brew "samba"
# Install Go static analysis tool
brew "staticcheck"
# Install symbolic link management tool
brew "symlinks"

# Install task runner and build tool
brew "task"
# Install task annotation opener
brew "taskopen"

# Install command correction tool
brew "thefuck"

# Install time tracking tool
brew "timewarrior"

# Install vulnerability scanner
brew "trivy"

# Install secrets scanner
brew "trufflehog"

# Install source code indexing tool
brew "universal-ctags"

# Install Linux utilities for macOS
brew "util-linux"

# Install fast Python package installer
brew "uv"

# Install VI-like file manager
# brew "vifm"
# 2025-12-16 : removed cause replaced by yazi

# Install terminal spreadsheet tool
brew "visidata"

# Install command execution monitor
brew "watch"

# Install JavaScript package manager
brew "yarn"
#
# Install terminal file manager
brew "yazi"

# Install Z shell
brew "zsh"
# Install Zsh autocompletion plugin
brew "zsh-autosuggestions"

# Install Zsh syntax highlighting plugin
brew "zsh-syntax-highlighting"

# Install opencode concurrent : crush
# obsidian://open?vault=obsperso&file=Permanent%2FInformatique%2FIA%2Fcrush
tap "charmbracelet/tap"
brew "charmbracelet/tap/crush"

# Install MongoDB database utilities
brew "mongodb/brew/mongodb-database-tools"

# Install OpenCode AI assistant
tap "sst/tap"
brew "sst/tap/opencode"

# Install Tabby AI code completion server
brew "tabbyml/tabby/tabby"
#
# Install spaced repetition flashcard app
cask "anki"
#
# Install USB/SD card imaging utility
cask "balenaetcher"
#
# Install file and folder comparison tool
cask "beyond-compare"

# 3D creation tool. Used by Albin.
cask "blender"

# Install Homebrew GUI manager
cask "brewlet"

# Install API testing client
# Alternative à postman
# obsidian://open?vault=obsperso&file=Permanent%2FInformatique%2FAppplication%20Bruno
cask "bruno"

# Install open-source web browser
cask "chromium"

# Install AI-powered code editor
cask "cursor"

# Install FTP/SFTP client
cask "cyberduck"

# Install decentralized messaging app
cask "deltachat"

# Install diagramming application
cask "drawio"

# Install collaborative design tool
cask "figma"

# Install Mozilla web browser
cask "firefox"

# Install 0xProto Nerd Font
cask "font-0xproto-nerd-font"
# Install Roboto Mono Nerd Font
cask "font-roboto-mono-nerd-font"
# Install Git GUI client
cask "fork"
# Install mind mapping software
cask "freeplane"
# Install Git GUI tool
cask "gg"
# Install image editing software
cask "gimp"
# Install Google web browser
cask "google-chrome"
# Install terminal emulator
cask "iterm2"
# Install office suite
cask "libreoffice"
# Install local LLM management tool
cask "lm-studio"
# Install knowledge management app
cask "logseq"
# Install RDP client
cask "microsoft-remote-desktop"
# Install MQTT client
cask "mqttx"
# Install note-taking and knowledge management app
cask "obsidian"
# Install Raspberry Pi SD card imager
cask "raspberry-pi-imager"
# Install menu bar Night Shift controller
cask "shifty"
# Install secure messaging app
cask "signal"
# Install media player
cask "vlc"
# Install open-source VS Code build
cask "vscodium"
# Install terminal emulator
cask "wezterm"
# Install Neovim integration for VS Code
vscode "asvetliakov.vscode-neovim"
# Install Make task provider for VS Code
vscode "carlos-algms.make-task-provider"
# Install AI coding assistant for VS Code
vscode "continue.continue"
# Install file save trigger extension
vscode "emeraldwalk.runonsave"
# Install Prettier code formatter extension
vscode "esbenp.prettier-vscode"
# Install GitHub Copilot AI assistant
vscode "github.copilot"
# Install GitHub Copilot chat interface
vscode "github.copilot-chat"
# Install Go language support extension
vscode "golang.go"
# Install Tabby AI completion extension
vscode "tabbyml.vscode-tabby"
# Install ChatGPT integration extension
vscode "timkmecl.chatgpt"
# Install HJSON syntax support
vscode "undefined_publisher.hjson-painless"
# Install Jujutsu VCS integration
vscode "visualjj.visualjj"
# Install Git blame annotation extension
vscode "waderyan.gitblame"
# Install Go call graph analysis tool
go "golang.org/x/tools/cmd/callgraph"
# Install Go debugger
go "github.com/go-delve/delve/cmd/dlv"
# Install Go error checking tool
go "github.com/kisielk/errcheck"
# Install Go struct field filler
go "github.com/davidrjenni/reftools/cmd/fillstruct"
# Install Go switch case filler
go "github.com/davidrjenni/reftools/cmd/fillswitch"
# Install Ginkgo BDD testing framework
go "github.com/onsi/ginkgo/v2/ginkgo"
# Install Go enum generator
go "github.com/abice/go-enum"
# Install stricter Go formatter
go "mvdan.cc/gofumpt"
# Install Go import organizer
go "golang.org/x/tools/cmd/goimports"
# Install JSON to Go struct converter
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
# Install Go linter runner
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
# Install Go line length formatter
go "github.com/segmentio/golines"
# Install Go style linter
go "golang.org/x/lint/golint"
# Install Go struct tag modifier
go "github.com/fatih/gomodifytags"
# Install Go MVP pattern generator
go "github.com/abenz1267/gomvp"
# Install Go project template tool
go "golang.org/x/tools/cmd/gonew"
# Install Go language server
go "golang.org/x/tools/gopls"
# Install Go identifier renaming tool
go "golang.org/x/tools/cmd/gorename"
# Install Go test generator
go "github.com/cweill/gotests/gotests"
# Install Go test runner with enhanced output
go "gotest.tools/gotestsum"
# Install Go vulnerability checker
go "golang.org/x/vuln/cmd/govulncheck"
# Install Go code analysis tool
go "golang.org/x/tools/cmd/guru"
# Install Go error handling generator
go "github.com/koron/iferr"
# Install Go interface implementation generator
go "github.com/josharian/impl"
# Install JSON to Go struct converter
go "github.com/tmc/json-to-struct"
# Install Makefile dependency visualizer
go "github.com/dnaeon/makefile-graph/cmd/makefile-graph"
# Install Go mock generator
go "go.uber.org/mock/mockgen"
# Install Powerline prompt for shell
go "github.com/justjanne/powerline-go"
# Install enhanced Go test output
go "github.com/kyoh86/richgo"
